# if01.py

# 축구 경기에서 이기면 승점 3점을 획득 합니다.

# 제어문 : 조건문, 반복문 + etc
# 조건문 : 만약 ~하면 ~ 하시요. if
# 반목문 : 특정한 구문이나 패턴을 반복적으로 수행하는 구분 for

"""
     if 조건문
        참일 때 수행
    else:
        거짓일 때 수행
"""

# 어떤 수가 짝수인지 홀수인지 판단하기

# 양자 택일 구분(둘 중 하나)(if else 구문이라고도 함)
su1 = 9
if su1 % 2 == 0 :
    print("짝수")
else :
    print("홀수")

print("-" * 30)

# 단순 if 구문 이라고함
su1 = 8
if su1 % 2 == 0 :
    print("짝수")

print("-" * 30)

# 문제 : 두 개의 정수 중에서 큰 수를 구해보세요.
# 10은 20보다 작습니다.

num1 = int(input("첫 번째 정수를 입력하세요 : "))
num2 = int(input("두 번째 정수를 입력하세요 : "))

if num1 > num2 :
    print("%d는 %d 보다 큽니다." %(num1, num2))
else:
    print("%d는 %d 보다 작습니다." %(num1, num2))

print("-" * 30)